lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    g_up_rw = len;
    board_flash_arena_commit(g_up_ro + g_up_rw);

    g_img      = (const uint8_t *)g_up_addr;
    g_img_ro   = g_up_ro;
    g_img_size = g_up_ro + g_up_rw;

    g_reload = true;
}

/*
 * Take a freshly uploaded image, if one is waiting. True when the guest
 * was restarted from it.
 *
 * One function because there are two places that must do this and they
 * are easy to let drift: between guest slices, and after a guest has
 * halted. The second is the one that matters for a test harness and was
 * the one missing.
 */
static bool take_uploaded_image(void)
{
    if (!g_reload) {
        return false;
    }
    g_reload = false;

    if (!start_guest()) {
        console_puts("emu: uploaded image does not fit guest RAM\n");
        return false;
    }

    console_puts("\nemu: running uploaded image, ");
    console_putu(g_img_ro);
    console_puts(" ro + ");
    console_putu(g_up_rw);
    console_puts(" rw bytes\n");
    return true;
}
#endif

/* ------------------------------------------------------------------ */
/* Diagnostics                                                         */
/* ------------------------------------------------------------------ */

/* emu_print_fn onto the console, for the frontend's own state dump. */
static void console_out(void *ctx, const char *s)
{
    (void)ctx;
    console_puts(s);
}

/*
 * Decoding the trap cause and naming the registers is the frontend's job:
 * only it knows what its status registers are and which of them matter
 * after a fault. This used to be a copy of that knowledge here, kept in
 * step with the core's by hand and with the other platform's by hand again.
 */
static void report_state(void)
{
    console_puts("\n-- guest state --");
    g_core.ops->dump(g_core.cpu, console_out, NULL);
}

/* ------------------------------------------------------------------ */
/* Entry                                                               */
/* ------------------------------------------------------------------ */

int main(void)
{
    board_init();

#if RV32_NATIVE_COREMARK
    /*
     * Native baseline: the same CoreMark sources compiled for Cortex-M7
     * and run directly, with no emulation, so the interpreter and JIT
     * numbers can be put against something absolute.
     */
    {
        extern int coremark_native_main(void);
        console_puts("\n\nrv32cortex-m: NATIVE CoreMark on Cortex-M7 @ ");
        console_putu(SystemCoreClock / 1000000u);
        console_puts(" MHz\n\n");
        const uint32_t c0 = board_cycles();
        (void)coremark_native_main();
        console_puts("\n-- native --\n  host     ");
        console_putu(board_cycles() - c0);
        console_puts(" cycles\n");
        for (;;) { __WFI(); }
    }
#endif
    /*
     * The frontend names itself, and builds its ISA string from the
     * extensions actually compiled in, so the banner cannot drift from what
     * the core implements -- which it could when this file spelled the
     * string out itself.
     */
    const emu_cpu_ops_t *const ops = emu_frontend_default();

    console_puts("\n\nrv32cortex-m: ");
    console_puts(ops->desc);
    console_puts(" on Cortex-M7 @ ");
    console_putu(SystemCoreClock / 1000000u);
    console_puts(" MHz\n");

#if EMU_NET
    /*
     * The handover happens here, before the rest of the banner, so that
     * everything describing what is about to run -- guest size, guest
     * RAM, which backend came up -- reaches a telnet client rather than
     * a serial port nobody is watching. It is buffered until one
     * connects, which is what net_telnet.c's output ring is for.
     *
     * The two lines below are the last thing the UART ever carries as
     * text, and they are deliberately the two that matter when nothing
     * works: whether the stack started at all, and what address to
     * connect to. After this, silence on the serial port is expected and
     * silence on the network is the fault.
     */
    console_puts("net    SLIP on this port; telnet ");
    console_puts(emu_net_addr_str());
    console_puts(" 23\n");
    if (!emu_net_init()) {
        console_puts("net    failed to start; staying on the serial console\n");
    }
#endif

    /*
     * Which image is running, before anything asks. build_address_space()
     * reads these rather than the .incbin symbols -- that is what lets an
     * upload replace the image at run time -- so leaving them until after
     * the bus is built publishes a zero-length ROM region, which the bus
     * rejects, and the firmware halts before it has run an instruction.
     */
    g_img_size = rv_guest_image_size;
    g_img_ro   = rv_guest_ro_size;

    if (!build_address_space()) {
        console_puts("fatal: could not build the guest address space\n");
        fatal_halt();
    }

    if (!emu_core_open(&g_core, ops, &g_bus, 0u)) {
        console_puts("fatal: frontend has no core 0\n");
        fatal_halt();
    }

    ops->set_unmask_hook(g_core.cpu, irq_unmask_line, NULL);
    bridged_irqs_init();
    emu_uart_init(&g_uart, guest_uart_tx, guest_uart_rx, NULL);
    ops->set_syscall(g_core.cpu, guest_syscall, NULL);
    ops->set_cache(g_core.cpu, &g_cache_ops);

#if EMU_NET
    /*
     * The gdb stub, once there is a core for it to describe. Started
     * after the guest exists and before it runs, so a debugger that
     * connects immediately finds the guest at its reset vector rather
     * than somewhere arbitrary.
     *
     * Failure is not fatal: a board that cannot serve gdb is still a
     * board that runs guests, and saying so beats halting.
     */
    {
        extern const emu_gdb_target_t *rv32_gdb_target(void);

        if (!emu_net_gdb_init(&g_core, rv32_gdb_target())) {
            console_puts("gdb    stub failed to start\n");
        } else {
            console_puts("gdb    target remote ");
            console_puts(emu_net_addr_str());
            console_puts(":1234\n");
        }
    }
#endif

    /*
     * Now that there is a core to hang them off, put the frontend's own
     * devices on the bus and start. start_guest() does both, because a
     * reload has to do both -- see the note on it.
     */
    if (!start_guest()) {
        console_puts("fatal: could not start the guest\n");
        fatal_halt();
    }

