lfazio/rv32cortex-m/src/platform/stm32f746/main.c
    /*
     * Everything from here down is one run of one guest, and an uploaded
     * image comes back to it. The banner is inside the loop deliberately:
     * it names the image's size, which is the first thing that differs
     * after a reload and the first thing a harness wants to see.
     */
restart:
    console_puts("guest  ");
    console_putu(g_img_size);
    console_puts(" bytes at ");
    console_puthex(EMU_GUEST_RESET_PC);
    console_puts("\nram    ");
    console_putu(GUEST_RAM_SIZE / 1024u);
    console_puts(" KiB (");
    console_putu(GUEST_RAM_SIZE);
    console_puts(" bytes)\nbackend ");

    emu_cpu_status_t st;
    emu_core_status(&g_core, &st);
    console_puts(st.backend);
    console_puts("\n\n");

    const uint32_t cycles_per_tick = SystemCoreClock / EMU_TIMER_HZ;
    const uint32_t start_cycles = board_cycles();
    uint64_t retired_total = 0;

    bool capped = false;

    for (;;) {
        uint32_t retired = 0;
        emu_run_reason_t why;

#if EMU_NET
        /*
         * With a debugger attached the stub owns run control: it honours
         * breakpoints and single-step, and while the guest is stopped it
         * retires nothing and this loop just services the network.
         *
         * Tested once per slice, not once per instruction. Nothing on
         * the execute path changes, so a guest nobody is debugging pays
         * for this exactly what it pays for emu_net_poll() -- one
         * predictable branch every 4096 instructions.
         */
        if (emu_net_gdb_attached()) {
            why = (emu_run_reason_t)emu_net_gdb_run(EMU_RUN_SLICE, &retired);
        } else
#endif
        {
            why = emu_core_run(&g_core, EMU_RUN_SLICE, &retired);
        }
        retired_total += retired;

#if EMU_NET
        /*
         * The stack advances only when called, so this is its entire
         * schedule. Once per slice is 4096 guest instructions, a few
         * hundred microseconds -- finer than any timer lwIP keeps and
         * far finer than the receive ring can fill, so nothing here
         * needs its own interrupt beyond the one taking bytes off the
         * wire.
         *
         * It is also the reason this port does not want an RTOS. A
         * scheduler would preempt on its tick, which is coarser than
         * this loop already is, and would buy nothing in exchange for
         * two stacks and lwIP's threaded API.
         */
        emu_net_poll();

        /*
         * A new image landed while the guest was between slices. Going
         * back to `restart` rather than continuing here restarts the
         * accounting with it, which matters: a run whose instruction
         * count carried over from the previous guest would hit the cap
         * early and report "did not terminate" about a guest that had
         * barely started.
         */
        if (take_uploaded_image()) {
            goto restart;
        }
#endif

        /*
         * Compared against the running total rather than a budget
         * counted down to zero. A block backend may retire more than
         * the slice it was given -- it can only stop between blocks --
         * so a remaining-budget subtraction goes below zero and wraps,
         * and the cap silently stops existing. That exact bug shipped in
         * the host runner and was invisible for the life of the project,
         * because the interpreter happens to land on the boundary
         * exactly.
         */
        if (EMU_MAX_INSN != 0u && retired_total >= (uint64_t)EMU_MAX_INSN) {
            capped = true;
            break;
        }

        /* Guest time tracks real time through the DWT cycle counter. */
        ops->set_time(g_core.cpu,
                      (uint64_t)(board_cycles() - start_cycles) / cycles_per_tick);

        if (why == EMU_RUN_HALTED) {
            break;
        }
        if (why == EMU_RUN_WFI) {
            emu_core_status(&g_core, &st);
            if (st.wakeable) {
                continue;
            }
            console_puts("\nguest parked with no interrupts enabled\n");
            break;
        }
    }

    const uint32_t elapsed = board_cycles() - start_cycles;

    if (capped) {
        /*
         * Named on its own line and before the statistics, so a harness
         * reading the console can tell "did not terminate" from "ran and
         * failed" without parsing the numbers.
         */
        console_puts("\nemu: instruction cap reached, guest did not halt\n");
    }

    console_puts("\n-- done --\n  retired  ");
    console_putu((uint32_t)retired_total);
    console_puts(" instructions\n  host     ");
    console_putu(elapsed);
    console_puts(" cycles\n  ratio    ");
    if (retired_total != 0u) {
        /* Host ARM cycles per emulated guest instruction, x100 so the
         * fractional part survives integer division. */
        const uint32_t x100 = (uint32_t)((uint64_t)elapsed * 100u / retired_total);
        console_putu(x100 / 100u);
        console_putc('.');
        console_putu((x100 % 100u) / 10u);
        console_putu(x100 % 10u);
        console_puts(" host cycles per guest instruction\n  speed    ");
        const uint32_t kips =
            (uint32_t)((uint64_t)retired_total * (SystemCoreClock / 1000u) / elapsed);
        console_putu(kips);
        console_puts(" KIPS\n");
    }

/*
 * JIT statistics: the one place in this file that names a frontend, and
 * unavoidably so -- the Thumb-2 JIT is the rv32 frontend's second backend.
 */
#if EMU_FRONTEND_RV32 && RV_ENABLE_JIT
    if (rv_backend == &rv_backend_jit) {
        rv_jit_stats_t js;
        rv_jit_get_stats(&js);
        console_puts("\n-- jit --\n  blocks   ");
        console_putu(js.blocks);
        console_puts("\n  code     ");
        console_putu(js.code_used);
        console_putc('/');
        console_putu(js.code_size);
        console_puts(" bytes\n  blks/xlat ");
        console_putu(js.translations);
        console_puts("\n  compact  ");
        console_putu(js.compactions);
        console_puts(" (");
        console_putu(js.evictions);
        console_puts(" evicted)\n  flushes  ");
        console_putu(js.flushes);
        /*
         * Instructions the translator declined and the interpreter ran.
         * A high share here is the first place to look when the speedup
         * is smaller than expected: it names exactly which encodings are
         * worth teaching the translator next.
         */
        console_puts("\n  interp   ");
        console_putu(js.interp_fallbacks);
        console_puts(" instructions fell back\n  helpers  muldiv ");
        console_putu(js.alu_calls_muldiv);
        console_puts("  clmul ");
        console_putu(js.alu_calls_clmul);
        console_puts("  bit ");
        console_putu(js.alu_calls_bit);
        console_puts("\n  pt hits  ");
        console_putu(js.pt_hits);
        console_puts(" armed ");
        console_putu(js.pt_armed);
        console_puts("\n  declined ");
        console_putu(js.declined);
        console_puts(" overflow ");
        console_putu(js.overflowed);
#ifdef EMU_JIT_PROFILE
        console_puts("\n  cyc xlat ");
        console_putu(js.cyc_translate);
        console_puts(" compact ");
        console_putu(js.cyc_compact);
#endif
        console_puts("\n  blk entr ");
        console_putu(js.block_entries);
        /*
         * Reads per block that uses the register, x100. Below 100 a cache
         * cannot pay: the block would spend a load to save fewer than one.
         */
        {
            static const char *const nm[4] = { "sp", "ra", "a0", "a1" };
            console_puts("\n  reads/blk");
            for (unsigned i = 0; i < 4u; i++) {
                console_putc(' ');
                console_puts(nm[i]);
                console_putc('=');
                if (js.hot_blocks[i] != 0u) {
                    const uint32_t x100 = js.hot_reads[i] * 100u / js.hot_blocks[i];
                    console_putu(x100 / 100u);
                    console_putc('.');
                    console_putu((x100 % 100u) / 10u);
                    console_putu(x100 % 10u);
                } else {
                    console_puts("-");
                }
                console_puts(" in ");
                console_putu(js.hot_blocks[i]);
            }
        }
        console_putc('\n');
    }
#endif

    report_state();

