lfazio/rv32cortex-m/src/platform/stm32f746/main.c
#if EMU_NET
    /*
     * Bytes the wire delivered and nothing collected. Reported next to
     * the guest's own numbers because it is the one failure that makes
     * *those* numbers untrustworthy without looking wrong: a dropped
     * byte is a dropped SLIP frame, which is a retransmission at best
     * and a truncated image at worst.
     */
    console_puts("\n-- net --\n  rx drops ");
    console_putu(board_console_rx_overruns());
    console_putc('\n');
#endif

    /*
     * The machine-readable terminator, and deliberately the last thing
     * printed for a run.
     *
     * A harness needs two things this report otherwise does not give it:
     * where the output for this guest *ends* -- there is no process to
     * exit, so nothing else says so -- and the guest's exit status,
     * which both test suites judge on and which was being captured and
     * then thrown away. run-riscv-tests.sh reads the runner's exit code
     * as (testnum << 1) | 1, so losing it means every result is "it ran".
     *
     * `exited` distinguishes a guest that called exit() from one that
     * halted or was capped, because exit=0 means nothing if the guest
     * never reached the syscall.
     */
    console_puts("\nemu-result exit=");
    console_putu(g_exit_code);
    console_puts(" exited=");
    console_putu(g_exited ? 1u : 0u);
    console_puts(" capped=");
    console_putu(capped ? 1u : 0u);
    console_puts(" retired=");
    console_putu((uint32_t)retired_total);
    console_putc('\n');

    for (;;) {
#if EMU_NET
        /*
         * Everything above is still sitting in the output ring: the run
         * loop stopped, and with it the only thing that was delivering.
         * Parking in __WFI without draining first would lose the entire
         * report -- which is the part a harness came for.
         *
         * __WFI is still right rather than a busy loop. The UART receive
         * interrupt is what wakes it, and that fires on the first byte
         * of anything the host sends, including the ACK for what is
         * being flushed here.
         */
        emu_net_poll();

        /*
         * An image may arrive after the guest has finished, and that is
         * the *normal* case rather than an edge one: a harness runs a
         * test, waits for it to halt and report, then pushes the next.
         * The reload check inside the run loop above never sees those,
         * because that loop exited when the guest halted -- so an upload
         * completed successfully, said so, and nothing happened.
         *
         * Jumping back to the top of the run is what makes the board a
         * server for the whole suite instead of a one-shot. `goto`
         * rather than wrapping the run in a function: everything it
         * needs is already local to main(), and a loop around all of it
         * would indent the entire body to say the same thing.
         */
        if (take_uploaded_image()) {
            goto restart;
        }
#endif
        __WFI();
    }
}
